{
    "pages": [
        {
            "desc_links": [
                "/wiki/Zero_vector",
                "/wiki/Field_(mathematics)",
                "/wiki/Vector_space",
                "/wiki/Vector_space",
                "/wiki/Linear_map",
                "/wiki/Linear_algebra",
                "/wiki/Scalar_(mathematics)",
                "/wiki/Matrix-vector_multiplication",
                "/wiki/Row_and_column_vectors",
                "/wiki/Square_matrix"
            ],
            "desc_text": "b''b'Geometrically an eigenvector, corresponding to a real nonzero eigenvalue, points in a direction that is stretched by the transformation and the eigenvalue is the factor by which it is stretched. If the eigenvalue is negative, the direction is reversed.[3]'b'There is a correspondence between n by n square matrices and linear transformations from an n-dimensional vector space to itself. For this reason, it is equivalent to define eigenvalues and eigenvectors using either the language of matrices or the language of linear transformations.[1][2]'b'If the vector space V is finite-dimensional, then the linear transformation T can be represented as a square matrix A, and the vector v by a column vector, rendering the above mapping as a matrix multiplication on the left hand side and a scaling of the column vector on the right hand side in the equation'b'where \\xce\\xbb is a scalar in the field F, known as the eigenvalue, characteristic value, or characteristic root associated with the eigenvector v.'b'In linear algebra, an eigenvector or characteristic vector of a linear transformation is a non-zero vector that only changes by a scalar factor when that linear transformation is applied to it. More formally, if T is a linear transformation from a vector space V over a field F into itself and v is a vector in V that is not the zero vector, then v is an eigenvector of T if T(v) is a scalar multiple of v. This condition can be written as the equation'",
            "links": [
                "/wiki/Zero_vector",
                "/wiki/Field_(mathematics)",
                "/wiki/Vector_space",
                "/wiki/Vector_space",
                "/wiki/Linear_map",
                "/wiki/Linear_algebra",
                "/wiki/Scalar_(mathematics)",
                "/wiki/Matrix-vector_multiplication",
                "/wiki/Row_and_column_vectors",
                "/wiki/Square_matrix",
                "/wiki/Eigendecomposition_of_a_matrix",
                "/wiki/Eigenface",
                "/wiki/Atomic_orbital",
                "/wiki/Vibration_analysis#eigenvalue_problem",
                "/wiki/Stability_theory",
                "/wiki/Rigid_body",
                "/wiki/Principal_axis_(mechanics)",
                "/wiki/German_language",
                "/wiki/Complex_number",
                "/wiki/Scalar_(mathematics)",
                "/wiki/Shear_mapping",
                "/wiki/Mona_Lisa",
                "/wiki/Diagonalizable_matrix",
                "/wiki/Matrix_decomposition",
                "/wiki/Differential_equation",
                "/wiki/Quadratic_form",
                "/wiki/Matrix_(mathematics)",
                "/wiki/Linear_algebra",
                "/wiki/Secular_equation",
                "/wiki/Quadric_surface",
                "/wiki/Augustin_Louis_Cauchy",
                "/wiki/Lagrange",
                "/wiki/Principal_axis_(mechanics)",
                "/wiki/Rigid_body",
                "/wiki/Leonhard_Euler",
                "/wiki/Defective_matrix",
                "/wiki/Stability_theory",
                "/wiki/Karl_Weierstrass",
                "/wiki/Skew-symmetric_matrix",
                "/wiki/Alfred_Clebsch",
                "/wiki/Unit_circle",
                "/wiki/Orthogonal_matrix",
                "/wiki/Francesco_Brioschi",
                "/wiki/Hermitian_matrix",
                "/wiki/Charles_Hermite",
                "/wiki/Jacques_Charles_Fran%C3%A7ois_Sturm",
                "/wiki/Th%C3%A9orie_analytique_de_la_chaleur",
                "/wiki/Separation_of_variables",
                "/wiki/Heat_equation",
                "/wiki/Joseph_Fourier",
                "/wiki/Poisson%27s_equation",
                "/wiki/Henri_Poincar%C3%A9",
                "/wiki/Laplace%27s_equation",
                "/wiki/Hermann_Schwarz",
                "/wiki/Sturm%E2%80%93Liouville_theory",
                "/wiki/Joseph_Liouville",
                "/wiki/Helmholtz",
                "/wiki/German_language",
                "/wiki/Integral_operator",
                "/wiki/David_Hilbert",
                "/wiki/Vera_Kublanovskaya",
                "/wiki/John_G.F._Francis",
                "/wiki/QR_algorithm",
                "/wiki/Power_method",
                "/wiki/Richard_Edler_von_Mises",
                "/wiki/Collinearity",
                "/wiki/Parallel_(geometry)",
                "/wiki/Scalar_multiplication",
                "/wiki/Identity_matrix",
                "/wiki/Determinant",
                "/wiki/Characteristic_polynomial",
                "/wiki/Coefficient",
                "/wiki/Degree_of_a_polynomial",
                "/wiki/Polynomial",
                "/wiki/Leibniz_formula_for_determinants",
                "/wiki/Factorization",
                "/wiki/Fundamental_theorem_of_algebra",
                "/wiki/Algebraic_number",
                "/wiki/Rational_number",
                "/wiki/Irrational_number",
                "/wiki/Real_matrix",
                "/wiki/Intermediate_value_theorem",
                "/wiki/Complex_conjugate",
                "/wiki/Polynomial_division",
                "/wiki/Multiple_roots_of_a_polynomial",
                "/wiki/Set_(mathematics)",
                "/wiki/Linear_subspace",
                "/wiki/Union_(set_theory)",
                "/wiki/Kernel_(linear_algebra)",
                "/wiki/Commutative_property",
                "/wiki/Distributive_property",
                "/wiki/Closure_(mathematics)",
                "/wiki/Matrix_similarity",
                "/wiki/Diagonalizable_matrix",
                "/wiki/Diagonalizable_matrix",
                "/wiki/Matrix_similarity",
                "/wiki/Eigendecomposition_of_a_matrix",
                "/wiki/Generalized_eigenspace",
                "/wiki/Jordan_normal_form",
                "/wiki/Jordan_normal_form",
                "/wiki/Generalized_eigenvector",
                "/wiki/Defective_matrix",
                "/wiki/Permutation_matrix",
                "/wiki/Diagonal_matrices",
                "/wiki/Triangular_matrix",
                "/wiki/Differential_equation",
                "/wiki/Derivative",
                "/wiki/Function_space",
                "/wiki/Differential_operator",
                "/wiki/Banach_space",
                "/wiki/Hilbert_space",
                "/wiki/Exponential_function",
                "/wiki/Eigenfunction",
                "/wiki/Scalar_(mathematics)",
                "/wiki/Field_(algebra)",
                "/wiki/Vector_space",
                "/wiki/Linear_map",
                "/wiki/Direct_sum",
                "/wiki/Invariant_subspace",
                "/wiki/Zero_vector",
                "/wiki/Bounded_operator",
                "/wiki/Spectrum_(functional_analysis)",
                "/wiki/Functional_analysis",
                "/wiki/Representation_theory",
                "/wiki/Module_(mathematics)",
                "/wiki/Associative_algebra",
                "/wiki/Algebra_representation",
                "/wiki/Weight_(representation_theory)",
                "/wiki/Difference_equation",
                "/wiki/Differential_equation",
                "/wiki/Wilkinson%27s_polynomial",
                "/wiki/Round-off_error",
                "/wiki/Accuracy",
                "/wiki/Iterative_method",
                "/wiki/Lanczos_algorithm",
                "/wiki/Sparse_matrix",
                "/wiki/Hermitian_matrix",
                "/wiki/Wikipedia:Citation_needed",
                "/wiki/Householder_transformation",
                "/wiki/QR_algorithm",
                "/wiki/Linear_system",
                "/wiki/Linear_equation",
                "/wiki/Squeeze_mapping",
                "/wiki/Roothaan_equations",
                "/wiki/Generalized_eigenvalue_problem",
                "/wiki/Basis_set_(chemistry)",
                "/wiki/Orthogonal",
                "/wiki/Quantum_chemistry",
                "/wiki/Self-consistent_field",
                "/wiki/Iteration",
                "/wiki/Koopmans%27_theorem",
                "/wiki/Ionization_potential",
                "/wiki/Fock_operator",
                "/wiki/Molecular_orbital",
                "/wiki/Atomic_orbital",
                "/wiki/Hartree%E2%80%93Fock",
                "/wiki/Molecular_physics",
                "/wiki/Atomic_physics",
                "/wiki/Quantum_mechanics",
                "/wiki/Clasts",
                "/wiki/Glacial_till",
                "/wiki/Geology",
                "/wiki/Orthogonal_basis",
                "/wiki/Explained_variance",
                "/wiki/Principal_components_analysis",
                "/wiki/Sample_variance",
                "/wiki/Correlation_matrix",
                "/wiki/Covariance_matrix",
                "/wiki/Linear_relation",
                "/wiki/Principal_components_analysis",
                "/wiki/Covariance_matrix",
                "/wiki/Sample_variance",
                "/wiki/Multivariate_statistics",
                "/wiki/Orthogonal_basis",
                "/wiki/Positive_semidefinite_matrix",
                "/wiki/Positive_semidefinite_matrix",
                "/wiki/Symmetric_matrix",
                "/wiki/Eigendecomposition_of_a_matrix#Real_symmetric_matrices",
                "/wiki/Structural_equation_model",
                "/wiki/Factor_analysis",
                "/wiki/Scree%27s_test",
                "/wiki/Hypothesis_testing",
                "/wiki/Statistical_significance",
                "/wiki/Q_methodology",
                "/wiki/Psychometrics",
                "/wiki/Marketing",
                "/wiki/Psychometrics",
                "/wiki/Chemometrics",
                "/wiki/Data_mining",
                "/wiki/Bioinformatics",
                "/wiki/Data_set",
                "/wiki/Data_mining",
                "/wiki/Degrees_of_freedom_(mechanics)",
                "/wiki/Quadratic_eigenvalue_problem",
                "/wiki/Quadratic_eigenvalue_problem#Methods_of_Solution",
                "/wiki/Finite_element_analysis",
                "/wiki/Recognition_of_human_individuals",
                "/wiki/Data_compression",
                "/wiki/Biometrics",
                "/wiki/Facial_recognition_system",
                "/wiki/Linear_combination",
                "/wiki/Principal_component_analysis",
                "/wiki/Eigenface",
                "/wiki/Covariance_matrix",
                "/wiki/Pixel",
                "/wiki/Brightness",
                "/wiki/Image_processing",
                "/wiki/Center_of_mass",
                "/wiki/Inertia",
                "/wiki/Tensor",
                "/wiki/Rigid_body",
                "/wiki/Principal_axis_(mechanics)",
                "/wiki/Inertia_Tensor",
                "/wiki/Mechanics",
                "/wiki/Shear_(mathematics)",
                "/wiki/Diagonal",
                "/wiki/Stress_(mechanics)",
                "/wiki/Solid_mechanics",
                "/wiki/Spectral_clustering",
                "/wiki/Markov_chain",
                "/wiki/Stationary_distribution",
                "/wiki/Adjacency_matrix",
                "/wiki/PageRank",
                "/wiki/Google",
                "/wiki/Eigenvector_centrality"
            ],
            "text": "The principal eigenvector is used to measure the centrality of its vertices. An example is Google's PageRank algorithm. The principal eigenvector of a modified adjacency matrix of the World Wide Web graph gives the page ranks as its components. This vector corresponds to the stationary distribution of the Markov chain represented by the row-normalized adjacency matrix; however, the adjacency matrix must first be modified to ensure a stationary distribution exists. The second smallest eigenvector can be used to partition the graph into clusters, via spectral clustering. Other methods are also available for clustering.In solid mechanics, the stress tensor is symmetric and so can be decomposed into a diagonal tensor with the eigenvalues on the diagonal and eigenvectors as a basis. Because it is diagonal, in this orientation, the stress tensor has no shear components; the components it does have are the principal components.In mechanics, the eigenvectors of the moment of inertia tensor define the principal axes of a rigid body. The tensor of moment of inertia is a key quantity required to determine the rotation of a rigid body around its center of mass.Similar to this concept, eigenvoices represent the general direction of variability in human pronunciations of a particular utterance, such as a word in a language. Based on a linear combination of such eigenvoices, a new voice pronunciation of the word can be constructed. These concepts have been found useful in automatic speech recognition systems for speaker adaptation.In image processing, processed images of faces can be seen as vectors whose components are the brightnesses of each pixel.[45] The dimension of this vector space is the number of pixels. The eigenvectors of the covariance matrix associated with a large set of normalized pictures of faces are called eigenfaces; this is an example of principal component analysis. They are very useful for expressing any face image as a linear combination of some of them. In the facial recognition branch of biometrics, eigenfaces provide a means of applying data compression to faces for identification purposes. Research related to eigen vision systems determining hand gestures has also been made.The orthogonality properties of the eigenvectors allows decoupling of the differential equations so that the system can be represented as linear summation of the eigenvectors. The eigenvalue problem of complex structures is often solved using finite element analysis, but neatly generalize the solution to scalar-valued vibration problems.This can be reduced to a generalized eigenvalue problem by algebraic manipulation at the cost of solving a larger system.leads to a so-called quadratic eigenvalue problem,orEigenvalue problems occur naturally in the vibration analysis of mechanical structures with many degrees of freedom. The eigenvalues are the natural frequencies (or eigenfrequencies) of vibration, and the eigenvectors are the shapes of these vibrational modes. In particular, undamped vibration is governed byPrincipal component analysis is used to study large data sets, such as those encountered in bioinformatics, data mining, chemical research, psychology, and in marketing. PCA is popular especially in psychology, in the field of psychometrics. In Q methodology, the eigenvalues of the correlation matrix determine the Q-methodologist's judgment of practical significance (which differs from the statistical significance of hypothesis testing; cf. criteria for determining the number of factors). More generally, principal component analysis can be used as a method of factor analysis in structural equation modeling.The eigendecomposition of a symmetric positive semidefinite (PSD) matrix yields an orthogonal basis of eigenvectors, each of which has a nonnegative eigenvalue. The orthogonal decomposition of a PSD matrix is used in multivariate analysis, where the sample covariance matrices are PSD. This orthogonal decomposition is called principal components analysis (PCA) in statistics. PCA studies linear relations among variables. PCA is performed on the covariance matrix or the correlation matrix (in which each variable is scaled to have its sample variance equal to one). For the covariance or correlation matrix, the eigenvectors correspond to principal components and the eigenvalues to the variance explained by the principal components. Principal component analysis of the correlation matrix provides an orthonormal eigen-basis for the space of the observed data: In this basis, the largest eigenvalues correspond to the principal components that are associated with most of the covariability among a number of observed data.In geology, especially in the study of glacial till, eigenvectors and eigenvalues are used as a method by which a mass of information of a clast fabric's constituents' orientation and dip can be summarized in a 3-D space by six numbers. In the field, a geologist may collect such data for hundreds or thousands of clasts in a soil sample, which can only be compared graphically such as in a Tri-Plot (Sneed and Folk) diagram,[40][41] or as a Stereonet on a Wulff Net.[42]In quantum mechanics, and in particular in atomic and molecular physics, within the Hartree–Fock theory, the atomic and molecular orbitals can be defined by the eigenvectors of the Fock operator. The corresponding eigenvalues are interpreted as ionization potentials via Koopmans' theorem. In this case, the term eigenvector is used in a somewhat more general meaning, since the Fock operator is explicitly dependent on the orbitals and their eigenvalues. Thus, if one wants to underline this aspect, one speaks of nonlinear eigenvalue problems. Such equations are usually solved by an iteration procedure, called in this case self-consistent field method. In quantum chemistry, one often represents the Hartree–Fock equation in a non-orthogonal basis set. This particular representation is a generalized eigenvalue problem called Roothaan equations.A linear transformation that takes a square to a rectangle of the same area (a squeeze mapping) has reciprocal eigenvalues.The following table presents some example transformations in the plane along with their 2×2 matrices, eigenvalues, and eigenvectors.Some numeric methods that compute the eigenvalues of a matrix also determine a set of corresponding eigenvectors as a by-product of the computation.This matrix equation is equivalent to two linear equationsOnce the (exact) value of an eigenvalue is known, the corresponding eigenvectors can be found by finding non-zero solutions of the eigenvalue equation, that becomes a system of linear equations with known coefficients. For example, once it is known that 6 is an eigenvalue of the matrixEfficient, accurate methods to compute eigenvalues and eigenvectors of arbitrary matrices were not known until the advent of the QR algorithm in 1961. [39] Combining the Householder transformation with the LU decomposition results in an algorithm with better convergence than the QR algorithm.[citation needed] For large Hermitian sparse matrices, the Lanczos algorithm is one example of an efficient iterative method to compute eigenvalues and eigenvectors, among several other possibilities.[39]In theory, the coefficients of the characteristic polynomial can be computed exactly, since they are sums of products of matrix elements; and there are algorithms that can find all the roots of a polynomial of arbitrary degree to any required accuracy.[39] However, this approach is not viable in practice because the coefficients would be contaminated by unavoidable round-off errors, and the roots of a polynomial can be an extremely sensitive function of the coefficients (as exemplified by Wilkinson's polynomial).[39]A similar procedure is used for solving a differential equation of the formThe solution of this equation for x in terms of t is found by using its characteristic equationThe simplest difference equations have the formThe representation-theoretical concept of weight is an analog of eigenvalues, while weight vectors and weight spaces are the analogs of eigenvectors and eigenspaces, respectively.One can generalize the algebraic object that is acting on the vector space, replacing a single operator acting on a vector space with an algebra representation – an associative algebra acting on a module. The study of such actions is the field of representation theory.For this reason, in functional analysis eigenvalues can be generalized to the spectrum of a linear operator T as the set of all scalars λ for which the operator (T − λI) has no bounded inverse. The spectrum of an operator always contains all its eigenvalues but is not limited to them.If λ is an eigenvalue of T, then the operator (T − λI) is not one-to-one, and therefore its inverse (T − λI)−1 does not exist. The converse is true for finite-dimensional vector spaces, but not for infinite-dimensional vector spaces. In general, the operator (T − λI) may not have an inverse even if λ is not an eigenvalue.Consider again the eigenvalue equation, Equation (5). Define an eigenvalue to be any scalar λ ∈ K such that there exists a non-zero vector v ∈ V satisfying Equation (5). It is important that this version of the definition of an eigenvalue specify that the vector be non-zero, otherwise by this definition the zero vector would allow any scalar in K to be an eigenvalue. Define an eigenvector v associated with the eigenvalue λ to be any vector that, given λ, satisfies Equation (5). Given the eigenvalue, the zero vector is among the vectors that satisfy Equation (5), so the zero vector is included among the eigenvectors by this alternate definition.While the definition of an eigenvector used in this article excludes the zero vector, it is possible to define eigenvalues and eigenvectors such that the zero vector is an eigenvector.[38]Any subspace spanned by eigenvectors of T is an invariant subspace of T, and the restriction of T to such a subspace is diagonalizable. Moreover, if the entire vector space V can be spanned by the eigenvectors of T, or equivalently if the direct sum of the eigenspaces associated with all the eigenvalues of T is the entire vector space V, then a basis of V called an eigenbasis can be formed from linearly independent eigenvectors of T. When T admits an eigenbasis, T is diagonalizable.The eigenspaces of T always form a direct sum. As a consequence, eigenvectors of different eigenvalues are always linearly independent. Therefore, the sum of the dimensions of the eigenspaces cannot exceed the dimension n of the vector space on which T operates, and there cannot be more than n distinct eigenvalues.[37]The geometric multiplicity γT(λ) of an eigenvalue λ is the dimension of the eigenspace associated with λ, i.e., the maximum number of linearly independent eigenvectors associated with that eigenvalue.[8][27] By the definition of eigenvalues and eigenvectors, γT(λ) ≥ 1 because every eigenvalue has at least one eigenvector.So, both u + v and αv are either zero or eigenvectors of T associated with λ, namely (u+v,αv) ∈ E, and E is closed under addition and scalar multiplication. The eigenspace E associated with λ is therefore a linear subspace of V.[8][34][35] If that subspace has dimension 1, it is sometimes called an eigenline.[36]for (x,y) ∈ V and α ∈ K. Therefore, if u and v are eigenvectors of T associated with eigenvalue λ, namely (u,v) ∈ E, thenBy definition of a linear transformation,which is the union of the zero vector with the set of all eigenvectors associated with λ. E is called the eigenspace or characteristic space of T associated with λ.Given an eigenvalue λ, consider the setThis equation is called the eigenvalue equation for T, and the scalar λ is the eigenvalue of T corresponding to the eigenvector v. Note that T(v) is the result of applying the transformation T to the vector v, while λv is the product of the scalar λ with v.[33]We say that a non-zero vector v ∈ V is an eigenvector of T if and only if there exists a scalar λ ∈ K such thatThe concept of eigenvalues and eigenvectors extends naturally to arbitrary linear transformations on arbitrary vector spaces. Let V be any vector space over some field K of scalars, and let T be a linear transformation mapping V into V,The main eigenfunction article gives other examples.is the eigenfunction of the derivative operator. Note that in this case the eigenfunction is itself a function of its associated eigenvalue. In particular, note that for λ = 0 the eigenfunction f(t) is a constant.This differential equation can be solved by multiplying both sides by dt/f(t) and integrating. Its solution, the exponential functionThe functions that satisfy this equation are eigenvectors of D and are commonly called eigenfunctions.The definitions of eigenvalue and eigenvectors of a linear transformation T remains valid even if the underlying vector space is an infinite-dimensional Hilbert or Banach space. A widely used class of linear transformations acting on infinite-dimensional spaces are the differential operators on function spaces. Let D be a linear differential operator on the space C∞ of infinitely differentiable real functions of a real argument t. The eigenvalue equation for D is the differential equationOn the other hand, the geometric multiplicity of the eigenvalue 2 is only 1, because its eigenspace is spanned by just one vector [0 1 −1 1]T and is therefore 1-dimensional. Similarly, the geometric multiplicity of the eigenvalue 3 is 1 because its eigenspace is spanned by just one vector [0 0 0 1]T. The total geometric multiplicity γA is 2, which is the smallest it could be for a matrix with two distinct eigenvalues. Geometric multiplicities are defined in a later section.The roots of this polynomial, and hence the eigenvalues, are 2 and 3. The algebraic multiplicity of each eigenvalue is 2; in other words they are both double roots. The sum of the algebraic multiplicities of each distinct eigenvalue is μA = 4 = n, the order of the characteristic polynomial and the dimension of A.has a characteristic polynomial that is the product of its diagonal elements,As in the previous example, the lower triangular matrixrespectively, as well as scalar multiples of these vectors.These eigenvalues correspond to the eigenvectors,which has the roots λ1 = 1, λ2 = 2, and λ3 = 3. These roots are the diagonal elements as well as the eigenvalues of A.The characteristic polynomial of A isConsider the lower triangular matrix,A matrix whose elements above the main diagonal are all zero is called a lower triangular matrix, while a matrix whose elements below the main diagonal are all zero is called an upper triangular matrix. As with diagonal matrices, the eigenvalues of triangular matrices are the elements of the main diagonal.respectively, as well as scalar multiples of these vectors.Each diagonal element corresponds to an eigenvector whose only non-zero component is in the same row as that diagonal element. In the example, the eigenvalues correspond to the eigenvectors,which has the roots λ1 = 1, λ2 = 2, and λ3 = 3. These roots are the diagonal elements as well as the eigenvalues of A.The characteristic polynomial of A isMatrices with entries only along the main diagonal are called diagonal matrices. The eigenvalues of a diagonal matrix are the diagonal elements themselves. Consider the matrixandThenFor the complex conjugate pair of imaginary eigenvalues, note thatFor the real eigenvalue λ1 = 1, any vector with three equal non-zero entries is an eigenvector. For example,This matrix shifts the coordinates of the vector up by one position and moves the first coordinate to the bottom. Its characteristic polynomial is 1 − λ3, whose roots areConsider the cyclic permutation matrixThe characteristic polynomial of A isConsider the matrixThus, the vectors vλ=1 and vλ=3 are eigenvectors of A associated with the eigenvalues λ = 1 and λ = 3, respectively.is an eigenvector of A corresponding to λ = 3, as is any scalar multiple of this vector.Any non-zero vector with v1 = v2 solves this equation. Therefore,For λ = 3, Equation (2) becomesis an eigenvector of A corresponding to λ = 1, as is any scalar multiple of this vector.Any non-zero vector with v1 = −v2 solves this equation. Therefore,For λ = 1, Equation (2) becomes,Setting the characteristic polynomial equal to zero, it has roots at λ = 1 and λ = 3, which are the two eigenvalues of A.Taking the determinant to find characteristic polynomial of A,The figure on the right shows the effect of this transformation on point coordinates in the plane. The eigenvectors v of this transformation satisfy Equation (1), and the values of λ for which the determinant of the matrix (A − λI) equals zero are the eigenvalues.Consider the matrixA matrix that is not diagonalizable is said to be defective. For defective matrices, the notion of eigenvectors generalizes to generalized eigenvectors and the diagonal matrix of eigenvalues generalizes to the Jordan normal form. Over an algebraically closed field, any matrix A has a Jordan normal form and therefore admits a basis of generalized eigenvectors and a decomposition into generalized eigenspaces.Conversely, suppose a matrix A is diagonalizable. Let P be a non-singular square matrix such that P−1AP is some diagonal matrix D. Left multiplying both by P, AP = PD. Each column of P must therefore be an eigenvector of A whose eigenvalue is the corresponding diagonal element of D. Since the columns of P must be linearly independent for P to be invertible, there exist n linearly independent eigenvectors of A. It then follows that the eigenvectors of A form a basis if and only if A is diagonalizable.A can therefore be decomposed into a matrix composed of its eigenvectors, a diagonal matrix with its eigenvalues along the diagonal, and the inverse of the matrix of eigenvectors. This is called the eigendecomposition and it is a similarity transformation. Such a matrix A is said to be similar to the diagonal matrix Λ or diagonalizable. The matrix Q is the change of basis matrix of the similarity transformation. Essentially, the matrices A and Λ represent the same linear transformation expressed in two different bases. The eigenvectors are used as the basis when representing the linear transformation as Λ.or by instead left multiplying both sides by Q−1,Because the columns of Q are linearly independent, Q is invertible. Right multiplying both sides of the equation by Q−1,With this in mind, define a diagonal matrix Λ where each diagonal element Λii is the eigenvalue associated with the ith column of Q. ThenSince each column of Q is an eigenvector of A, right multiplying A by Q scales each column of Q by its associated eigenvalue,Suppose the eigenvectors of A form a basis, or equivalently A has n linearly independent eigenvectors v1, v2, ..., vn with associated eigenvalues λ1, λ2, ..., λn. The eigenvalues need not be distinct. Define a square matrix Q whose columns are the n linearly independent eigenvectors of A,Comparing this equation to Equation (1), it follows immediately that a left eigenvector of A is the same as the transpose of a right eigenvector of AT, with the same eigenvalue. Furthermore, since the characteristic polynomial of AT is the same as the characteristic polynomial of A, the eigenvalues of the left eigenvectors of A are the same as the eigenvalues of the right eigenvectors of AT.where κ is a scalar and u is a 1 by n matrix. Any row vector u satisfying this equation is called a left eigenvector of A and κ is its associated eigenvalue. Taking the transpose of this equation,The eigenvalue and eigenvector problem can also be defined for row vectors that left multiply matrix A. In this formulation, the defining equation isMany disciplines traditionally represent vectors as matrices with a single column rather than as matrices with a single row. For that reason, the word \"eigenvector\" in the context of matrices almost always refers to a right eigenvector, namely a column vector that right multiplies the n by n matrix A in the defining equation, Equation (1),Let A be an arbitrary n by n matrix of complex numbers with eigenvalues λ1, λ2, ..., λn. Each eigenvalue appears μA(λi) times in this list, where μA(λi) is the eigenvalue's algebraic multiplicity. The following are properties of this matrix and its eigenvalues:is the dimension of the union of all the eigenspaces of A's eigenvalues, or equivalently the maximum number of linearly independent eigenvectors of A. If γA = n, thenSuppose A has d ≤ n distinct eigenvalues λ1, λ2, ..., λd, where the geometric multiplicity of λi is γA(λi). The total geometric multiplicity of A,The condition that γA(λ) ≤ μA(λ) can be proven by considering a particular eigenvalue ξ of A and diagonalizing the first γA(ξ) columns of A with respect to the eigenvectors of ξ, described in a later section. The resulting similar matrix B is block upper triangular, with its top left block being the diagonal matrix ξIγA(ξ). As a result, the characteristic polynomial of B will have a factor of (ξ − λ)γA(ξ). The other factors of the characteristic polynomial of B are not known, so the algebraic multiplicity of ξ as an eigenvalue of B is no less than the geometric multiplicity of ξ as an eigenvalue of A. The last element of the proof is the property that similar matrices have the same characteristic polynomial.Because of the definition of eigenvalues and eigenvectors, an eigenvalue's geometric multiplicity must be at least one, that is, each eigenvalue has at least one associated eigenvector. Furthermore, an eigenvalue's geometric multiplicity cannot exceed its algebraic multiplicity. Additionally, recall that an eigenvalue's algebraic multiplicity cannot exceed n.The dimension of the eigenspace E associated with λ, or equivalently the maximum number of linearly independent eigenvectors associated with λ, is referred to as the eigenvalue's geometric multiplicity γA(λ). Because E is also the nullspace of (A − λI), the geometric multiplicity of λ is the dimension of the nullspace of (A − λI), also called the nullity of (A − λI), which relates to the dimension and rank of (A − λI) asBecause the eigenspace E is a linear subspace, it is closed under addition. That is, if two vectors u and v belong to the set E, written (u,v) ∈ E, then (u + v) ∈ E or equivalently A(u + v) = λ(u + v). This can be checked using the distributive property of matrix multiplication. Similarly, because E is a linear subspace, it is closed under scalar multiplication. That is, if v ∈ E and α is a complex number, (αv) ∈ E or equivalently A(αv) = λ(αv). This can be checked by noting that multiplication of complex matrices by complex numbers is commutative. As long as u + v and αv are not zero, they are also eigenvectors of A associated with λ.On one hand, this set is precisely the kernel or nullspace of the matrix (A − λI). On the other hand, by definition, any non-zero vector that satisfies this condition is an eigenvector of A associated with λ. So, the set E is the union of the zero vector with the set of all eigenvectors of A associated with λ, and E equals the nullspace of (A − λI). E is called the eigenspace or characteristic space of A associated with λ.[7][8] In general λ is a complex number and the eigenvectors are complex n by 1 matrices. A property of the nullspace is that it is a linear subspace, so E is a linear subspace of ℂn.Given a particular eigenvalue λ of the n by n matrix A, define the set E to be all vectors v that satisfy Equation (2),If μA(λi) = 1, then λi is said to be a simple eigenvalue.[27] If μA(λi) equals the geometric multiplicity of λi, γA(λi), defined in the next section, then λi is said to be a semisimple eigenvalue.If d = n then the right hand side is the product of n linear terms and this is the same as Equation (4). The size of each eigenvalue's algebraic multiplicity is related to the dimension n asSuppose a matrix A has dimension n and d ≤ n distinct eigenvalues. Whereas Equation (4) factors the characteristic polynomial of A into the product of n linear terms with some terms potentially repeating, the characteristic polynomial can instead be written as the product of d terms each corresponding to a distinct eigenvalue and raised to the power of the algebraic multiplicity,Let λi be an eigenvalue of an n by n matrix A. The algebraic multiplicity μA(λi) of the eigenvalue is its multiplicity as a root of the characteristic polynomial, that is, the largest integer k such that (λ − λi)k divides evenly that polynomial.[8][26][27]The non-real roots of a real polynomial with real coefficients can be grouped into pairs of complex conjugates, namely with the two members of each pair having imaginary parts that differ only in sign and the same real part. If the degree is odd, then by the intermediate value theorem at least one of the roots is real. Therefore, any real matrix with odd order has at least one real eigenvalue, whereas a real matrix with even order may not have any real eigenvalues. The eigenvectors associated with these complex eigenvalues are also complex and also appear in complex conjugate pairs.If the entries of the matrix A are all real numbers, then the coefficients of the characteristic polynomial will also be real numbers, but the eigenvalues may still have non-zero imaginary parts. The entries of the corresponding eigenvectors therefore may also have non-zero imaginary parts. Similarly, the eigenvalues may be irrational numbers even if all the entries of A are rational numbers or even if they are all integers. However, if the entries of A are all algebraic numbers, which include the rationals, the eigenvalues are complex algebraic numbers.Setting the characteristic polynomial equal to zero, it has roots at λ = 1 and λ = 3, which are the two eigenvalues of M. The eigenvectors corresponding to each eigenvalue can be found by solving for the components of v in the equation Mv = λv. In this example, the eigenvectors are any non-zero scalar multiples ofTaking the determinant of (M − λI), the characteristic polynomial of M isAs a brief example, which is described in more detail in the examples section later, consider the matrixwhere each λi may be real but in general is a complex number. The numbers λ1, λ2, ... λn, which may not all have distinct values, are roots of the polynomial and are the eigenvalues of A.The fundamental theorem of algebra implies that the characteristic polynomial of an n by n matrix A, being a polynomial of degree n, can be factored into the product of n linear terms,Using Leibniz' rule for the determinant, the left hand side of Equation (3) is a polynomial function of the variable λ and the degree of this polynomial is n, the order of the matrix A. Its coefficients depend on the entries of A, except that its term of degree n is always (−1)nλn. This polynomial is called the characteristic polynomial of A. Equation (3) is called the characteristic equation or the secular equation of A.Equation (2) has a non-zero solution v if and only if the determinant of the matrix (A − λI) is zero. Therefore, the eigenvalues of A are values of λ that satisfy the equationwhere I is the n by n identity matrix.Equation (1) can be stated equivalently asthen v is an eigenvector of the linear transformation A and the scale factor λ is the eigenvalue corresponding to that eigenvector. Equation (1) is the eigenvalue equation for the matrix A.If it occurs that v and w are scalar multiples, that is ifwhere, for each row,orNow consider the linear transformation of n-dimensional vectors defined by an n by n matrix A,In this case λ = −1/20.These vectors are said to be scalar multiples of each other, or parallel or collinear, if there is a scalar λ such thatConsider n-dimensional vectors that are formed as a list of n scalars, such as the three-dimensional vectorsEigenvalues and eigenvectors are often introduced to students in the context of linear algebra courses focused on matrices.[23][24] Furthermore, linear transformations can be represented using matrices,[1][2] which is especially common in numerical and computational applications.[25]The first numerical algorithm for computing eigenvalues and eigenvectors appeared in 1929, when Von Mises published the power method. One of the most popular methods today, the QR algorithm, was proposed independently by John G.F. Francis[20] and Vera Kublanovskaya[21] in 1961.[22]At the start of the 20th century, Hilbert studied the eigenvalues of integral operators by viewing the operators as infinite matrices.[17] He was the first to use the German word eigen, which means \"own\", to denote eigenvalues and eigenvectors in 1904,[18] though he may have been following a related usage by Helmholtz. For some time, the standard term in English was \"proper value\", but the more distinctive term \"eigenvalue\" is standard today.[19]In the meantime, Liouville studied eigenvalue problems similar to those of Sturm; the discipline that grew out of their work is now called Sturm–Liouville theory.[15] Schwarz studied the first eigenvalue of Laplace's equation on general domains towards the end of the 19th century, while Poincaré studied Poisson's equation a few years later.[16]Fourier used the work of Laplace and Lagrange to solve the heat equation by separation of variables in his famous 1822 book Théorie analytique de la chaleur.[14] Sturm developed Fourier's ideas further and brought them to the attention of Cauchy, who combined them with his own ideas and arrived at the fact that real symmetric matrices have real eigenvalues.[11] This was extended by Hermite in 1855 to what are now called Hermitian matrices.[12] Around the same time, Brioschi proved that the eigenvalues of orthogonal matrices lie on the unit circle,[11] and Clebsch found the corresponding result for skew-symmetric matrices.[12] Finally, Weierstrass clarified an important aspect in the stability theory started by Laplace by realizing that defective matrices can cause instability.[11]In the 18th century Euler studied the rotational motion of a rigid body and discovered the importance of the principal axes.[9] Lagrange realized that the principal axes are the eigenvectors of the inertia matrix.[10] In the early 19th century, Cauchy saw how their work could be used to classify the quadric surfaces, and generalized it to arbitrary dimensions.[11] Cauchy also coined the term racine caractéristique (characteristic root) for what is now called eigenvalue; his term survives in characteristic equation.[12][13]Eigenvalues are often introduced in the context of linear algebra or matrix theory. Historically, however, they arose in the study of quadratic forms and differential equations.Eigenvalues and eigenvectors give rise to many closely related mathematical concepts, and the prefix eigen- is applied liberally when naming them:where the eigenvector v is an n by 1 matrix. For a matrix, eigenvalues and eigenvectors can be used to decompose the matrix, for example by diagonalizing it.Alternatively, the linear transformation could take the form of an n by n matrix, in which case the eigenvectors are n by 1 matrices that are also referred to as eigenvectors. If the linear transformation is expressed in the form of an n by n matrix A, then the eigenvalue equation above for a linear transformation can be rewritten as the matrix multiplicationThe Mona Lisa example pictured at right provides a simple illustration. Each point on the painting can be represented as a vector pointing from the center of the painting to that point. The linear transformation in this example is called a shear mapping. Points in the top half are moved to the right and points in the bottom half are moved to the left proportional to how far they are from the horizontal axis that goes through the middle of the painting. The vectors pointing to each point in the original image are therefore tilted right or left and made longer or shorter by the transformation. Notice that points along the horizontal axis do not move at all when this transformation is applied. Therefore, any vector that points directly to the right or left with no vertical component is an eigenvector of this transformation because the mapping does not change its direction. Moreover, these eigenvectors all have an eigenvalue equal to one because the mapping does not change their length, either.referred to as the eigenvalue equation or eigenequation. In general, λ may be any scalar. For example, λ may be negative, in which case the eigenvector reverses direction as part of the scaling, or it may be zero or complex.In essence, an eigenvector v of a linear transformation T is a non-zero vector that, when T is applied to it, does not change direction. Applying T to the eigenvector only scales the eigenvector by the scalar value λ, called an eigenvalue. This condition can be written as the equationEigenvalues and eigenvectors feature prominently in the analysis of linear transformations. The prefix eigen- is adopted from the German word eigen for \"proper\", \"characteristic\".[4] Originally utilized to study principal axes of the rotational motion of rigid bodies, eigenvalues and eigenvectors have a wide range of applications, for example in stability analysis, vibration analysis, atomic orbitals, facial recognition, and matrix diagonalization.Geometrically an eigenvector, corresponding to a real nonzero eigenvalue, points in a direction that is stretched by the transformation and the eigenvalue is the factor by which it is stretched. If the eigenvalue is negative, the direction is reversed.[3]There is a correspondence between n by n square matrices and linear transformations from an n-dimensional vector space to itself. For this reason, it is equivalent to define eigenvalues and eigenvectors using either the language of matrices or the language of linear transformations.[1][2]If the vector space V is finite-dimensional, then the linear transformation T can be represented as a square matrix A, and the vector v by a column vector, rendering the above mapping as a matrix multiplication on the left hand side and a scaling of the column vector on the right hand side in the equationwhere λ is a scalar in the field F, known as the eigenvalue, characteristic value, or characteristic root associated with the eigenvector v.In linear algebra, an eigenvector or characteristic vector of a linear transformation is a non-zero vector that only changes by a scalar factor when that linear transformation is applied to it. More formally, if T is a linear transformation from a vector space V over a field F into itself and v is a vector in V that is not the zero vector, then v is an eigenvector of T if T(v) is a scalar multiple of v. This condition can be written as the equation",
            "title": "Eigenvalues and eigenvectors",
            "url": "https://en.wikipedia.org/wiki/Eigenvalues_and_eigenvectors"
        }
    ]
}