[
    {
        "children": [
            {
                "desc": "b'A meme (/mi\\xcb\\x90m/ MEEM[1][2][3]) is an idea, behavior, or style that spreads from person to person within a culture\\xe2\\x80\\x94often with the aim of conveying a particular phenomenon, theme, or meaning represented by the meme.[4] A meme acts as a unit for carrying cultural ideas, symbols, or practices, that can be transmitted from one mind to another through writing, speech, gestures, rituals, or other imitable phenomena with a mimicked theme. Supporters of the concept regard memes as cultural analogues to genes in that they self-replicate, mutate, and respond to selective pressures.[5]'b\"Proponents theorize that memes are a viral phenomenon that may evolve by natural selection in a manner analogous to that of biological evolution. Memes do this through the processes of variation, mutation, competition, and inheritance, each of which influences a meme's reproductive success. Memes spread through the behavior that they generate in their hosts. Memes that propagate less prolifically may become extinct, while others may survive, spread, and (for better or for worse) mutate. Memes that replicate most effectively enjoy more success, and some may replicate effectively even when they prove to be detrimental to the welfare of their hosts.[6]\"b\"A field of study called memetics[7] arose in the 1990s to explore the concepts and transmission of memes in terms of an evolutionary model. Criticism from a variety of fronts has challenged the notion that academic study can examine memes empirically. However, developments in neuroimaging may make empirical study possible.[8] Some commentators in the social sciences question the idea that one can meaningfully categorize culture in terms of discrete units, and are especially critical of the biological nature of the theory's underpinnings.[9] Others have argued that this use of the term is the result of a misunderstanding of the original proposal.[10]\"b'The word meme is a neologism coined by Richard Dawkins.[11] It originated from Dawkins\\' 1976 book The Selfish Gene. Dawkins\\'s own position is somewhat ambiguous: he welcomed N. K. Humphrey\\'s suggestion that \"memes should be considered as living structures, not just metaphorically\"[12] and proposed to regard memes as \"physically residing in the brain\".[13] Later, he argued that his original intentions, presumably before his approval of Humphrey\\'s opinion, had been simpler.[14]'b''",
                "freq": 20,
                "title": "Meme",
                "url": "https://en.wikipedia.org/wiki/Meme"
        },
            {
                "desc": "b'An intron is any nucleotide sequence within a gene that is removed by RNA splicing during maturation of the final RNA product.[1][2] The term intron refers to both the DNA sequence within a gene and the corresponding sequence in RNA transcripts.[3] Sequences that are joined together in the final mature RNA after RNA splicing are exons. Introns are found in the genes of most organisms and many viruses, and can be located in a wide range of genes, including those that generate proteins, ribosomal RNA (rRNA), and transfer RNA (tRNA). When proteins are generated from intron-containing genes, RNA splicing takes place as part of the RNA processing pathway that follows transcription and precedes translation.'b'The word intron is derived from the term intragenic region, i.e. a region inside a gene. Although introns are sometimes called intervening sequences, the term \"intervening sequence\" can refer to any of several families of internal nucleic acid sequences that are not present in the final gene product, including inteins, untranslated sequences (UTR), and nucleotides removed by RNA editing, in addition to introns.'b''",
                "freq": 1,
                "title": "Intron",
                "url": "https://en.wikipedia.org/wiki/Non-gene_locus"
        },
            {
                "desc": "b\"A phenotype (from Greek phainein, meaning 'to show', and typos, meaning 'type') is the composite of an organism's observable characteristics or traits, such as its morphology, development, biochemical or physiological properties, behavior, and products of behavior (such as a bird's nest). A phenotype results from the expression of an organism's genetic code, its genotype, as well as the influence of environmental factors and the interactions between the two. When two or more clearly different phenotypes exist in the same population of a species, the species is called polymorphic. A well-documented polymorphism is Labrador Retriever coloring; while the coat color depends on many genes, it is clearly seen in the environment as yellow, black and brown.\"b\"This genotype-phenotype distinction was proposed by Wilhelm Johannsen in 1911 to make clear the difference between an organism's heredity and what that heredity produces.[1][2] The distinction is similar to that proposed by August Weismann, who distinguished between germ plasm (heredity) and somatic cells (the body). The genotype-phenotype distinction should not be confused with Francis Crick's central dogma of molecular biology, which is a statement about the directionality of molecular sequential information flowing from DNA to protein, and not the reverse.\"b'Richard Dawkins in 1978[3] and then again in his 1982 book The Extended Phenotype suggested that bird nests and other built structures such as caddis fly larvae cases and beaver dams can be considered as \"extended phenotypes\".'b''",
                "freq": 1,
                "title": "Phenotype",
                "url": "https://en.wikipedia.org/wiki/Phenotypic_variation"
        },
            {
                "desc": "b'In computer science, evolutionary computation is a family of algorithms for global optimization inspired by biological evolution, and the subfield of artificial intelligence and soft computing studying these algorithms. In technical terms, they are a family of population-based trial and error problem solvers with a metaheuristic or stochastic optimization character.'b'In evolutionary computation, an initial set of candidate solutions is generated and iteratively updated. Each new generation is produced by stochastically removing less desired solutions, and introducing small random changes. In biological terminology, a population of solutions is subjected to natural selection (or artificial selection) and mutation. As a result, the population will gradually evolve to increase in fitness, in this case the chosen fitness function of the algorithm.'b'Evolutionary computation techniques can produce highly optimized solutions in a wide range of problem settings, making them popular in computer science. Many variants and extensions exist, suited to more specific families of problems and data structures. Evolutionary computation is also sometimes used in evolutionary biology as an in silico experimental procedure to study common aspects of general evolutionary processes.'b''",
                "freq": 1,
                "title": "Evolutionary computation",
                "url": "https://en.wikipedia.org/wiki/Evolutionary_computation"
        },
            {
                "desc": "b'Subculture, a concept from the academic fields of sociology and cultural studies, is a group of people within a culture that differentiates itself from the parent culture to which it belongs, often maintaining some of its founding principles. Subcultures develop their own norms and values regarding cultural, political and sexual matters. Certain subcultures are immersed in the society more than others while keeping their specific characteristics intact, such is the case with hippies, goths and even bikers.[1] Subcultures differ from countercultures.'b''",
                "freq": 1,
                "title": "Subculture",
                "url": "https://en.wikipedia.org/wiki/Subculture"
        }
      ]
  },
    {
        "children": [
            {
                "desc": "b\"Memetics is the study of information and culture based on an analogy with Darwinian evolution. Proponents describe memetics as an approach to evolutionary models of cultural information transfer. Critics regard memetics as a pseudoscience. Memetics describes how an idea can propogate successfully, but doesn't necessarily imply a concept is factual.[1]\"b'The term meme was coined in Richard Dawkins\\' 1976 book The Selfish Gene, but Dawkins later distanced himself from the resulting field of study.[2] Analogous to a gene, the meme was conceived as a \"unit of culture\" (an idea, belief, pattern of behaviour, etc.) which is \"hosted\" in the minds of one or more individuals, and which can reproduce itself in the sense of jumping from the mind of one person to the mind of another. Thus what would otherwise be regarded as one individual influencing another to adopt a belief is seen as an idea-replicator reproducing itself in a new host. As with genetics, particularly under a Dawkinsian interpretation, a meme\\'s success may be due to its contribution to the effectiveness of its host.'b'The Usenet newsgroup alt.memetics started in 1993 with peak posting years in the mid to late 1990s.[3] The Journal of Memetics was published electronically from 1997 to 2005.[4]'b''",
                "freq": 1,
                "title": "Memetics",
                "url": "https://en.wikipedia.org/wiki/Memetics"
        },
            {
                "desc": "b'Evolution is change in the heritable characteristics of biological populations over successive generations.[1][2] Evolutionary processes give rise to biodiversity at every level of biological organisation, including the levels of species, individual organisms, and molecules.[3]'b'Repeated formation of new species (speciation), change within species (anagenesis), and loss of species (extinction) throughout the evolutionary history of life on Earth are demonstrated by shared sets of morphological and biochemical traits, including shared DNA sequences.[4] These shared traits are more similar among species that share a more recent common ancestor, and can be used to reconstruct a biological \"tree of life\" based on evolutionary relationships (phylogenetics), using both existing species and fossils. The fossil record includes a progression from early biogenic graphite,[5] to microbial mat fossils,[6][7][8] to fossilised multicellular organisms. Existing patterns of biodiversity have been shaped both by speciation and by extinction.[9]'b'In the mid-19th century, Charles Darwin formulated the scientific theory of evolution by natural selection, published in his book On the Origin of Species (1859). Evolution by natural selection is a process first demonstrated by the observation that often, more offspring are produced than can possibly survive. This is followed by three observable facts about living organisms: 1) traits vary among individuals with respect to morphology, physiology, and behaviour (phenotypic variation), 2) different traits confer different rates of survival and reproduction (differential fitness), and 3) traits can be passed from generation to generation (heritability of fitness).[10] Thus, in successive generations members of a population are replaced by progeny of parents better adapted to survive and reproduce in the biophysical environment in which natural selection takes place.'b'This teleonomy is the quality whereby the process of natural selection creates and preserves traits that are seemingly fitted for the functional roles they perform.[11] The processes by which the changes occur, from one generation to another, are called evolutionary processes or mechanisms.[12] The four most widely recognised evolutionary processes are natural selection (including sexual selection), genetic drift, mutation and gene migration due to genetic admixture.[12] Natural selection and genetic drift sort variation; mutation and gene migration create variation.[12]'b'Consequences of selection can include meiotic drive[13] (unequal transmission of certain alleles), nonrandom mating[14] and genetic hitchhiking. In the early 20th century the modern evolutionary synthesis integrated classical genetics with Darwin\\'s theory of evolution by natural selection through the discipline of population genetics. The importance of natural selection as a cause of evolution was accepted into other branches of biology. Moreover, previously held notions about evolution, such as orthogenesis, evolutionism, and other beliefs about innate \"progress\" within the largest-scale trends in evolution, became obsolete.[15] Scientists continue to study various aspects of evolutionary biology by forming and testing hypotheses, constructing mathematical models of theoretical biology and biological theories, using observational data, and performing experiments in both the field and the laboratory.'b'All life on Earth shares a common ancestor known as the last universal common ancestor (LUCA),[16][17][18] which lived approximately 3.5\\xe2\\x80\\x933.8 billion years ago.[19] A December 2017 report stated that 3.45 billion-year-old Australian rocks once contained microorganisms, the earliest direct evidence of life on Earth.[20][21] Nonetheless, this should not be assumed to be the first living organism on Earth; a study in 2015 found \"remains of biotic life\" from 4.1 billion years ago in ancient rocks in Western Australia.[22][23] In July 2016, scientists reported identifying a set of 355 genes from the LUCA of all organisms living on Earth.[24] More than 99 percent of all species that ever lived on Earth are estimated to be extinct.[25][26] Estimates of Earth\\'s current species range from 10 to 14 million,[27][28] of which about 1.9 million are estimated to have been named[29] and 1.6 million documented in a central database to date.[30] More recently, in May 2016, scientists reported that 1 trillion species are estimated to be on Earth currently with only one-thousandth of one percent described.[31]'b'In terms of practical application, an understanding of evolution has been instrumental to developments in numerous scientific and industrial fields, including agriculture, human and veterinary medicine, and the life sciences in general.[32][33][34] Discoveries in evolutionary biology have made a significant impact not just in the traditional branches of biology but also in other academic disciplines, including biological anthropology, and evolutionary psychology.[35][36] Evolutionary computation, a sub-field of artificial intelligence, involves the application of Darwinian principles to problems in computer science.'b''",
                "freq": 1,
                "title": "Evolution",
                "url": "https://en.wikipedia.org/wiki/Evolution"
        },
            {
                "desc": "b'A neologism (/ni\\xcb\\x90\\xcb\\x88\\xc9\\x92l\\xc9\\x99d\\xca\\x92\\xc9\\xaaz\\xc9\\x99m/; from Greek \\xce\\xbd\\xce\\xad\\xce\\xbf- n\\xc3\\xa9o-, \"new\" and \\xce\\xbb\\xcf\\x8c\\xce\\xb3\\xce\\xbf\\xcf\\x82 l\\xc3\\xb3gos, \"speech, utterance\") is a relatively recent or isolated term, word, or phrase that may be in the process of entering common use, but that has not yet been fully accepted into mainstream language.[1] Neologisms are often directly attributable to a specific person, publication, period, or event. In the process of language formation, neologisms are more mature than protologisms.[2]'b''",
                "freq": 2,
                "title": "Neologism",
                "url": "https://en.wikipedia.org/wiki/Neologism"
        }
        ]
  },
    {
        "children": [
            {
                "desc": "b'Leadership is both a research area and a practical skill encompassing the ability of an individual or organization to \"lead\" or guide other individuals, teams, or entire organizations.[citation needed] Specialist literature debates various viewpoints, contrasting Eastern and Western approaches to leadership, and also (within the West) United States versus European approaches. U.S. academic environments define leadership as \"a process of social influence in which a person can enlist the aid and support of others in the accomplishment of a common task\".[1][2] Leadership seen from a European and non-academic perspective encompasses a view of a leader who can be moved not only by communitarian goals but also by the search for personal power.[citation needed] Leadership can derive from a combination of several factors.[citation needed]'b'Studies of leadership have produced theories involving traits,[3] situational interaction, function, behavior,[4] power, vision and values,[5] charisma, and intelligence, among others.[2]'b''",
                "freq": 1,
                "title": "Leadership",
                "url": "https://en.wikipedia.org/wiki/Leadership"
        },
            {
                "desc": "b'Leadership is both a research area and a practical skill encompassing the ability of an individual or organization to \"lead\" or guide other individuals, teams, or entire organizations.[citation needed] Specialist literature debates various viewpoints, contrasting Eastern and Western approaches to leadership, and also (within the West) United States versus European approaches. U.S. academic environments define leadership as \"a process of social influence in which a person can enlist the aid and support of others in the accomplishment of a common task\".[1][2] Leadership seen from a European and non-academic perspective encompasses a view of a leader who can be moved not only by communitarian goals but also by the search for personal power.[citation needed] Leadership can derive from a combination of several factors.[citation needed]'b'Studies of leadership have produced theories involving traits,[3] situational interaction, function, behavior,[4] power, vision and values,[5] charisma, and intelligence, among others.[2]'b''",
                "freq": 1,
                "title": "Leadership",
                "url": "https://en.wikipedia.org/wiki/Leadership"
        },
            {
                "desc": "b'Leadership is both a research area and a practical skill encompassing the ability of an individual or organization to \"lead\" or guide other individuals, teams, or entire organizations.[citation needed] Specialist literature debates various viewpoints, contrasting Eastern and Western approaches to leadership, and also (within the West) United States versus European approaches. U.S. academic environments define leadership as \"a process of social influence in which a person can enlist the aid and support of others in the accomplishment of a common task\".[1][2] Leadership seen from a European and non-academic perspective encompasses a view of a leader who can be moved not only by communitarian goals but also by the search for personal power.[citation needed] Leadership can derive from a combination of several factors.[citation needed]'b'Studies of leadership have produced theories involving traits,[3] situational interaction, function, behavior,[4] power, vision and values,[5] charisma, and intelligence, among others.[2]'b''",
                "freq": 1,
                "title": "Leadership",
                "url": "https://en.wikipedia.org/wiki/Leadership"
        }
      ]
  }
]
