[
    {
        "children": [
            {
                "desc": "b'Solid-state physics is the study of rigid matter, or solids, through methods such as quantum mechanics, crystallography, electromagnetism, and metallurgy. It is the largest branch of condensed matter physics. Solid-state physics studies how the large-scale properties of solid materials result from their atomic-scale properties. Thus, solid-state physics forms a theoretical basis of materials science. It also has direct applications, for example in the technology of transistors and semiconductors.'b''",
                "freq": 20,
                "title": "Solid-state physics",
                "url": "https://en.wikipedia.org/wiki/Solid_state_physics"
            }
        ]
    },
    {
        "children": [
            {
                "desc": "b'Chemistry is the scientific discipline involved with compounds composed of atoms, i.e. elements, and molecules, i.e. combinations of atoms: their composition, structure, properties, behavior and the changes they undergo during a reaction with other compounds.[1][2] Chemistry addresses topics such as how atoms and molecules interact via chemical bonds to form new chemical compounds. There are four types of chemical bonds: covalent bonds, in which compounds share one or more electron(s); ionic bonds, in which a compound donates one or more electrons to another compound to produce ions (cations and anions); hydrogen bonds; and Van der Waals force bonds.'b'In the scope of its subject, chemistry occupies an intermediate position between physics and biology.[3] It is sometimes called the central science because it provides a foundation for understanding both basic and applied scientific disciplines at a fundamental level.[4] Examples include plant chemistry (botany), the formation of igneous rocks (geology), how atmospheric ozone is formed and how environmental pollutants are degraded (ecology), the properties of the soil on the moon (astrophysics), how medications work (pharmacology), and how to collect DNA evidence at a crime scene (forensics).'b'The history of chemistry spans a period from very old times to the present. Since several millennia BC, civilizations were using technologies that would eventually form the basis of the various branches of chemistry. Examples include extracting metals from ores, making pottery and glazes, fermenting beer and wine, extracting chemicals from plants for medicine and perfume, rendering fat into soap, making glass, and making alloys like bronze. Chemistry was preceded by its protoscience, alchemy, which is an intuitive but non-scientific approach to understanding the constituents of matter and their interactions. It was unsuccessful in explaining the nature of matter and its transformations, but, by performing experiments and recording the results, alchemists set the stage for modern chemistry. Chemistry as a body of knowledge distinct from alchemy began to emerge when a clear differentiation was made between them by Robert Boyle in his work The Sceptical Chymist (1661). While both alchemy and chemistry are concerned with matter and its transformations, the crucial difference was given by the scientific method that chemists employed in their work. Chemistry is considered to have become an established science with the work of Antoine Lavoisier, who developed a law of conservation of mass that demanded careful measurement and quantitative observations of chemical phenomena. The history of chemistry is intertwined with the history of thermodynamics, especially through the work of Willard Gibbs.[5]'b''",
                "freq": 2,
                "title": "Chemistry",
                "url": "https://en.wikipedia.org/wiki/Chemistry"
            },
            {
                "desc": "b'A wave function in quantum physics is a mathematical description of the quantum state of an isolated quantum system. The wave function is a complex-valued probability amplitude, and the probabilities for the possible results of measurements made on the system can be derived from it. The most common symbols for a wave function are the Greek letters \\xcf\\x88 or \\xce\\xa8 (lower-case and capital psi, respectively).'b'The wave function is a function of the degrees of freedom corresponding to some maximal set of commuting observables. Once such a representation is chosen, the wave function can be derived from the quantum state.'b'For a given system, the choice of which commuting degrees of freedom to use is not unique, and correspondingly the domain of the wave function is also not unique. For instance it may be taken to be a function of all the position coordinates of the particles over position space, or the momenta of all the particles over momentum space; the two are related by a Fourier transform. Some particles, like electrons and photons, have nonzero spin, and the wave function for such particles includes spin as an intrinsic, discrete degree of freedom; other discrete variables can also be included, such as isospin. When a system has internal degrees of freedom, the wave function at each point in the continuous degrees of freedom (e.g., a point in space) assigns a complex number for each possible value of the discrete degrees of freedom (e.g., z-component of spin) -- these values are often displayed in a column matrix (e.g., a 2 \\xc3\\x97 1 column vector for a non-relativistic electron with spin \\xe2\\x80\\x8b1\\xe2\\x81\\x842).'b'According to the superposition principle of quantum mechanics, wave functions can be added together and multiplied by complex numbers to form new wave functions and form a Hilbert space. The inner product between two wave functions is a measure of the overlap between the corresponding physical states, and is used in the foundational probabilistic interpretation of quantum mechanics, the Born rule, relating transition probabilities to inner products. The Schr\\xc3\\xb6dinger equation determines how wave functions evolve over time, and a wave function behaves qualitatively like other waves, such as water waves or waves on a string, because the Schr\\xc3\\xb6dinger equation is mathematically a type of wave equation. This explains the name \"wave function,\" and gives rise to wave\\xe2\\x80\\x93particle duality. However, the wave function in quantum mechanics describes a kind of physical phenomenon, still open to different interpretations, which fundamentally differs from that of classic mechanical waves.[1][2][3][4][5][6][7]'b\"In Born's statistical interpretation in non-relativistic quantum mechanics,[8][9][10] the squared modulus of the wave function, |\\xcf\\x88|2, is a real number interpreted as the probability density of measuring a particle's being detected at a given place \\xe2\\x80\\x93 or having a given momentum \\xe2\\x80\\x93 at a given time, and possibly having definite values for discrete degrees of freedom. The integral of this quantity, over all the system's degrees of freedom, must be 1 in accordance with the probability interpretation. This general requirement that a wave function must satisfy is called the normalization condition. Since the wave function is complex valued, only its relative phase and relative magnitude can be measured\\xe2\\x80\\x94its value does not, in isolation, tell anything about the magnitudes or directions of measurable observables; one has to apply quantum operators, whose eigenvalues correspond to sets of possible results of measurements, to the wave function \\xcf\\x88 and calculate the statistical distributions for measurable quantities.\"b''",
                "freq": 2,
                "title": "Wave function",
                "url": "https://en.wikipedia.org/wiki/Wave_function"
            },
            {
                "desc": "b'In theoretical physics, quantum field theory (QFT) is the theoretical framework for constructing quantum mechanical models of subatomic particles in particle physics and quasiparticles in condensed matter physics. It is a set of notions and mathematical tools that combines classical fields, special relativity, and quantum mechanics,[1] and, when combined with the cluster decomposition principle,[2] it may be the only way to do so,[3] while retaining the ideas of quantum point particles and locality. QFT was historically widely believed to be truly fundamental. It is now believed, primarily due to the continued failures of quantization of general relativity, to be only a very good low-energy approximation, i.e. an effective field theory, to some more fundamental theory.'b'QFT treats particles as excited states of an underlying field, so these are called field quanta. In quantum field theory, quantum mechanical interactions among particles are described by interaction terms among the corresponding underlying quantum fields. These interactions are conveniently visualized by Feynman diagrams, which are a formal tool of relativistically covariant perturbation theory, serving to evaluate particle processes.'b''",
                "freq": 2,
                "title": "Quantum field theory",
                "url": "https://en.wikipedia.org/wiki/Quantum_field_theory"
            }
        ]
    },
    {
        "children": [
            {
                "desc": "b'This article includes a list of the different types of atomic- and sub-atomic particles found or hypothesized to exist in the whole of the universe categorized by type. Properties of the various particles listed are also given, as well as the laws that the particles follow. For individual lists of the different particles, see the list below.'b''",
                "freq": 2,
                "title": "List of particles",
                "url": "https://en.wikipedia.org/wiki/Composite_particle"
            },
            {
                "desc": "",
                "freq": 1,
                "title": "Maxwell's equations",
                "url": "https://en.wikipedia.org/wiki/Maxwell%27s_equations"
            },
            {
                "desc": "b'Greek (Modern Greek: \\xce\\xb5\\xce\\xbb\\xce\\xbb\\xce\\xb7\\xce\\xbd\\xce\\xb9\\xce\\xba\\xce\\xac [elini\\xcb\\x88ka], ellinik\\xc3\\xa1, \"Greek\", \\xce\\xb5\\xce\\xbb\\xce\\xbb\\xce\\xb7\\xce\\xbd\\xce\\xb9\\xce\\xba\\xce\\xae \\xce\\xb3\\xce\\xbb\\xcf\\x8e\\xcf\\x83\\xcf\\x83\\xce\\xb1 [elini\\xcb\\x88ci \\xcb\\x88\\xc9\\xa3losa]\\xc2\\xa0(\\xc2\\xa0listen), ellinik\\xc3\\xad gl\\xc3\\xb3ssa, \"Greek language\") is an independent branch of the Indo-European family of languages, native to Greece and other parts of the Eastern Mediterranean. It has the longest documented history of any living Indo-European language, spanning 34 centuries (3,400 years) of written records.[4] Its writing system has been the Greek alphabet for the major part of its history; other systems, such as Linear B and the Cypriot syllabary, were used previously.[5] The alphabet arose from the Phoenician script and was in turn the basis of the Latin, Cyrillic, Armenian, Coptic, Gothic and many other writing systems.'b'The Greek language holds an important place in the history of the Western world and Christianity; the canon of ancient Greek literature includes works in the Western canon such as the epic poems Iliad and Odyssey. Greek is also the language in which many of the foundational texts in science, especially astronomy, mathematics and logic, and Western philosophy, such as the Platonic dialogues and the works of Aristotle, are composed; the New Testament of the Christian Bible was written in Koin\\xc3\\xa9 Greek. Together with the Latin texts and traditions of the Roman world, the study of the Greek texts and society of antiquity constitutes the discipline of Classics.'b'During antiquity, Greek was a widely spoken lingua franca in the Mediterranean world and many places beyond. It would eventually become the official parlance of the Byzantine Empire and develop into Medieval Greek.[6] In its modern form, the Greek language is the official language in two countries, Greece and Cyprus, a recognised minority language in seven other countries, and is one of the 24 official languages of the European Union. The language is spoken by at least 13.2 million people today in Greece, Cyprus, Italy, Albania, Turkey, and the Greek diaspora.'b'Greek roots are often used to coin new words for other languages; Greek and Latin are the predominant sources of international scientific vocabulary.'b''",
                "freq": 1,
                "title": "Greek language",
                "url": "https://en.wikipedia.org/wiki/Greek_language"
            }
        ]
    },
    {
        "children": [
            {
                "desc": "b'A biomaterial is any substance that has been engineered to interact with biological systems for a medical purpose - either a therapeutic (treat, augment, repair or replace a tissue function of the body) or a diagnostic one. As a science, biomaterials is about fifty years old. The study of biomaterials is called biomaterials science or biomaterials engineering. It has experienced steady and strong growth over its history, with many companies investing large amounts of money into the development of new products. Biomaterials science encompasses elements of medicine, biology, chemistry, tissue engineering and materials science.'b'Note that a biomaterial is different from a biological material, such as bone, that is produced by a biological system. Additionally, care should be exercised in defining a biomaterial as biocompatible, since it is application-specific. A biomaterial that is biocompatible or suitable for one application may not be biocompatible in another.[1]'b''",
                "freq": 3,
                "title": "Biomaterial",
                "url": "https://en.wikipedia.org/wiki/Biomaterial"
            },
            {
                "desc": "b\"A diode is a two-terminal electronic component that conducts current primarily in one direction (asymmetric conductance); it has low (ideally zero) resistance in one direction, and high (ideally infinite) resistance in the other. A semiconductor diode, the most common type today, is a crystalline piece of semiconductor material with a p\\xe2\\x80\\x93n junction connected to two electrical terminals.[5] A vacuum tube diode has two electrodes, a plate (anode) and a heated cathode. Semiconductor diodes were the first semiconductor electronic devices. The discovery of crystals' rectifying abilities was made by German physicist Ferdinand Braun in 1874. The first semiconductor diodes, called cat's whisker diodes, developed around 1906, were made of mineral crystals such as galena. Today, most diodes are made of silicon, but other materials such as selenium and germanium are sometimes used.[6]\"b''",
                "freq": 1,
                "title": "Diode",
                "url": "https://en.wikipedia.org/wiki/Diode"
            },
            {
                "desc": "b'Chemistry is the scientific discipline involved with compounds composed of atoms, i.e. elements, and molecules, i.e. combinations of atoms: their composition, structure, properties, behavior and the changes they undergo during a reaction with other compounds.[1][2] Chemistry addresses topics such as how atoms and molecules interact via chemical bonds to form new chemical compounds. There are four types of chemical bonds: covalent bonds, in which compounds share one or more electron(s); ionic bonds, in which a compound donates one or more electrons to another compound to produce ions (cations and anions); hydrogen bonds; and Van der Waals force bonds.'b'In the scope of its subject, chemistry occupies an intermediate position between physics and biology.[3] It is sometimes called the central science because it provides a foundation for understanding both basic and applied scientific disciplines at a fundamental level.[4] Examples include plant chemistry (botany), the formation of igneous rocks (geology), how atmospheric ozone is formed and how environmental pollutants are degraded (ecology), the properties of the soil on the moon (astrophysics), how medications work (pharmacology), and how to collect DNA evidence at a crime scene (forensics).'b'The history of chemistry spans a period from very old times to the present. Since several millennia BC, civilizations were using technologies that would eventually form the basis of the various branches of chemistry. Examples include extracting metals from ores, making pottery and glazes, fermenting beer and wine, extracting chemicals from plants for medicine and perfume, rendering fat into soap, making glass, and making alloys like bronze. Chemistry was preceded by its protoscience, alchemy, which is an intuitive but non-scientific approach to understanding the constituents of matter and their interactions. It was unsuccessful in explaining the nature of matter and its transformations, but, by performing experiments and recording the results, alchemists set the stage for modern chemistry. Chemistry as a body of knowledge distinct from alchemy began to emerge when a clear differentiation was made between them by Robert Boyle in his work The Sceptical Chymist (1661). While both alchemy and chemistry are concerned with matter and its transformations, the crucial difference was given by the scientific method that chemists employed in their work. Chemistry is considered to have become an established science with the work of Antoine Lavoisier, who developed a law of conservation of mass that demanded careful measurement and quantitative observations of chemical phenomena. The history of chemistry is intertwined with the history of thermodynamics, especially through the work of Willard Gibbs.[5]'b''",
                "freq": 1,
                "title": "Chemistry",
                "url": "https://en.wikipedia.org/wiki/Chemistry"
            }
        ]
    }
]